12/data/attachments/fc622d7a00177b98.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_96174e0f-7c12-4fd6-8959-083d7615408d</nif:username>
            <nif:friendToBeAdded>Erin_improve_Friend_62066_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>